app/controllers/authentications_controller.rb

  def destroy
    if request.headers['Authentication-Token']
      user = User.find_by(:authentication_token => request.headers['Authentication-Token'])
      user.update_attributes(:authentication_token => nil)
---
SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = ? LIMIT ?  [["authentication_token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoxMSwiZXhwIjoxNTE0NjgxMzAxfQ.4SHN5-_Itzxc1-O7XQoxmgmHX7bI5tjNxu46Zzvod-M"], ["LIMIT", 1]]
UPDATE "users" SET "authentication_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authentication_token", nil], ["updated_at", "2017-12-30 03:17:37.479972"], ["id", 11]]