app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@example.com"], ["LIMIT", 1]]
UPDATE "users" SET "authentication_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authentication_token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjozLCJleHAiOjE1MTM3MjkzNzJ9.C6qDcceaPeWNXi_lIKymkbKFO2SEyLVy2rKfmA25KD4"], ["updated_at", "2017-12-19 00:22:52.733216"], ["id", 3]]
---
  def create
    # initialize and execute the command
    # NOTE: `.call` is a shortcut for `.new(args).call)`
    command = AuthenticateUser.call(params[:email], params[:password])

    # check command outcome
    if command.success?
      user = User.find_by_email(params[:email])
      user.update_attributes(:authentication_token => command.result)