app/controllers/bolts_controller.rb

SELECT "bolts".* FROM "bolts"
---
  def index
    @bolts = Bolt.all