app/controllers/fabrics_controller.rb

SELECT "fabrics".* FROM "fabrics"
---
  def index
    @fabrics = Fabric.all

SELECT  "fabrics".* FROM "fabrics" WHERE "fabrics"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @fabric = Fabric.find(params[:id])

INSERT INTO "fabrics" ("user_id", "fabric_type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["fabric_type_id", 1], ["created_at", "2017-12-15 02:44:20.078654"], ["updated_at", "2017-12-15 02:44:20.078654"]]
---
  def create
    @fabric = Fabric.new(fabric_params)
    @fabric.create_fabrics_inventory_types(:inventory_type_id => fabric_params[:inventory_type_id])

SELECT  "fabrics".* FROM "fabrics" WHERE "fabrics"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def update
    @fabric = Fabric.find(params[:id])

SELECT  "fabrics".* FROM "fabrics" WHERE "fabrics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "fabrics" WHERE "fabrics"."id" = ?  [["id", 1]]
---
  def destroy
    @fabric = Fabric.find(params[:id])

    if @fabric.destroy