app/controllers/fabric_types_controller.rb

  def index
    @fabric_types = FabricType.all
---
SELECT "fabric_types".* FROM "fabric_types"

    def set_fabric_type
      @fabric_type = FabricType.find(params[:id])
---
SELECT  "fabric_types".* FROM "fabric_types" WHERE "fabric_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]