app/controllers/inventory_types_controller.rb

SELECT "inventory_types".* FROM "inventory_types"
---
  def index
    @types = InventoryType.all