app/controllers/swatches_controller.rb

  def index
    @swatches = Swatch.all
---
SELECT "swatches".* FROM "swatches"